<?php

// +----------------------------------------------------------------------
// | ThinkAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2019 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://demo.thinkadmin.top
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | gitee 开源项目：https://gitee.com/zoujingli/ThinkAdmin
// | github开源项目：https://github.com/zoujingli/ThinkAdmin
// +----------------------------------------------------------------------

return [
    //-----------------------------------------------------------
    //    本源码仅供学习研究测试, 请勿用做商业或者用于其他违法行为,一切后果自负！！！
    //-----------------------------------------------------------

    // 数据库调试模式
    'debug'       => true,
    // 数据库类型
    'type'        => env('database_type','mysql') ,
    // 服务器地址
    'hostname'    => env('hostname','127.0.0.1'),
    // 'hostname'    => '127.0.0.1',
    // 数据库名
    'database'    => env('database','sd6'),
    // 用户名
    'username'    => env('username','root'),
    // 密码
    'password'    => env('password','root'),//HT8MRyXFBCAMbnce
    // 编码
    'charset'     => env('charset','utf8mb4'),
    // 端口
    'hostport'    => env('hostport','3306'),
    // 主从
    'deploy'      => 0,
    // 分离
    'rw_separate' => false,
];
